#include "GV.h"

int block_map0[MAX_BLOCK_Y][MAX_BLOCK_X] =
{
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,1,1,1,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
};

int block_map1[MAX_BLOCK_Y][MAX_BLOCK_X] =
{
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,1,0,1,0,1,0,1,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,00,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
};

int block_map2[MAX_BLOCK_Y][MAX_BLOCK_X] =
{
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,1,0,1,0,0,0,1,0,1,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
};

int block_map3[MAX_BLOCK_Y][MAX_BLOCK_X] =
{
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,1,0,1,0,0,0,1,0,1,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
};

int block_map4[MAX_BLOCK_Y][MAX_BLOCK_X] =
{
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,1,0,1,0,0,0,1,0,1,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,1,0,1,0,1,0,1,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,1,0,1,0,0,0,1,0,1,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,1,0,1,0,1,0,1,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,1,0,1,0,0,0,1,0,1,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,1,0,1,0,1,0,1,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
};
int block_map5[MAX_BLOCK_Y][MAX_BLOCK_X] =
{
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{1,0,0,0,0,0,0,0,0,0,1},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0},
};

void create_blocks() {
	switch(Stage_Num)
	{
	case 0: {
		//ブロックのマップデータが1の場所だけTrueにする
		int count = 0;
		for (int i = 0; i < MAX_BLOCK_Y; i++) {
			for (int j = 0; j < MAX_BLOCK_X; j++) {
				if (!blocks[i].flg && block_map0[i][j] != 0) {
					blocks[count].x = BLOCK_WIDTH * (float)j;
					blocks[count].y = BLOCK_HEIGHT * (float)i;
					blocks[count].flg = true;
					blocks[count].hp = 9;//ここはブロックのHP用のHPデータを使う・もしくはランダムでHPを割り当てる
				}
				count++;
			}
		}
		break;
	}
	case 1: {
		//ブロックのマップデータが1の場所だけTrueにする
		int count = 0;
		for (int i = 0; i < MAX_BLOCK_Y; i++) {
			for (int j = 0; j < MAX_BLOCK_X; j++) {
				if (!blocks[i].flg && block_map1[i][j] != 0) {
					blocks[count].x = BLOCK_WIDTH * (float)j;
					blocks[count].y = BLOCK_HEIGHT * (float)i;
					blocks[count].flg = true;
					blocks[count].hp = 9;//ここはブロックのHP用のHPデータを使う・もしくはランダムでHPを割り当てる
				}
				count++;
			}
		}
		break;
	}
	case 2: {
		//ブロックのマップデータが1の場所だけTrueにする
		int count = 0;
		for (int i = 0; i < MAX_BLOCK_Y; i++) {
			for (int j = 0; j < MAX_BLOCK_X; j++) {
				if (block_map2[i][j] != 0) {
					blocks[count].x = BLOCK_WIDTH * (float)j;
					blocks[count].y = BLOCK_HEIGHT * (float)i;
					blocks[count].flg = true;
					blocks[count].hp = 9;//ここはブロックのHP用のHPデータを使う・もしくはランダムでHPを割り当てる
				}
				count++;
			}
		}
		break;
	}
	case 3: {
		//ブロックのマップデータが1の場所だけTrueにする
		int count = 0;
		for (int i = 0; i < MAX_BLOCK_Y; i++) {
			for (int j = 0; j < MAX_BLOCK_X; j++) {
				if (block_map3[i][j] != 0) {
					blocks[count].x = BLOCK_WIDTH * (float)j;
					blocks[count].y = BLOCK_HEIGHT * (float)i;
					blocks[count].flg = true;
					blocks[count].hp = 9;//ここはブロックのHP用のHPデータを使う・もしくはランダムでHPを割り当てる
				}
				count++;
			}
		}
		break;
	}
	case 4: {
		//ブロックのマップデータが1の場所だけTrueにする
		int count = 0;
		for (int i = 0; i < MAX_BLOCK_Y; i++) {
			for (int j = 0; j < MAX_BLOCK_X; j++) {
				if (block_map4[i][j] != 0) {
					blocks[count].x = BLOCK_WIDTH * (float)j;
					blocks[count].y = BLOCK_HEIGHT * (float)i;
					blocks[count].flg = true;
					blocks[count].hp = 9;//ここはブロックのHP用のHPデータを使う・もしくはランダムでHPを割り当てる
				}
				count++;
			}
		}
		break;
	}
	case 5: {
		//ブロックのマップデータが1の場所だけTrueにする
		int count = 0;
		for (int i = 0; i < MAX_BLOCK_Y; i++) {
			for (int j = 0; j < MAX_BLOCK_X; j++) {
				if (block_map5[i][j] != 0) {
					blocks[count].x = BLOCK_WIDTH * (float)j;
					blocks[count].y = BLOCK_HEIGHT * (float)i;
					blocks[count].flg = true;
					blocks[count].hp = 9;//ここはブロックのHP用のHPデータを使う・もしくはランダムでHPを割り当てる
				}
				count++;
			}
		}
		break;
	}
	default:
		Game = 0;
		Stage_Num = 0;
		break;
	}
}

